In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
s = Series([10, 20, 30, 40, 50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s.index = list('abcde')
s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
s = Series([10,20,30,40,50],index=list('abcde'))
s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
s.loc['a']

10

In [7]:
s.reset_index()

  index   0
0     a  10
1     b  20
2     c  30
3     d  40
4     e  50

In [9]:
df = s.reset_index()
df

  index   0
0     a  10
1     b  20
2     c  30
3     d  40
4     e  50

In [11]:
df.set_index('index')

        0
index
a      10
b      20
c      30
d      40
e      50

In [12]:
df

  index   0
0     a  10
1     b  20
2     c  30
3     d  40
4     e  50

In [13]:
df.set_index(0)

   index
0
10     a
20     b
30     c
40     d
50     e

In [14]:
df[0]

0    10
1    20
2    30
3    40
4    50
Name: 0, dtype: int64

In [16]:
df.loc[ df['index'] == 'c' ]

  index   0
2     c  30

In [18]:
df.set_index('index').loc['c']

0    30
Name: c, dtype: int64

In [22]:
dates= Series(['0531', '0601', '0602', '0603','0604', '0605', '0606', '0607', '0608', '0609'])
dates

0    0531
1    0601
2    0602
3    0603
4    0604
5    0605
6    0606
7    0607
8    0608
9    0609
dtype: object

In [26]:
temps = Series([23,24,25,22,21,26,28,27,29,30], index=dates)
temps

0531    23
0601    24
0602    25
0603    22
0604    21
0605    26
0606    28
0607    27
0608    29
0609    30
dtype: int64

In [27]:
temps.reset_index()

  index   0
0  0531  23
1  0601  24
2  0602  25
3  0603  22
4  0604  21
5  0605  26
6  0606  28
7  0607  27
8  0608  29
9  0609  30

In [38]:
temps[ (temps.index == '0602') | (temps.index== '0605')]

0602    25
0605    26
dtype: int64

In [40]:
temps[ (temps.index.isin(['0602','0605']))]

0602    25
0605    26
dtype: int64

In [39]:
temps

0531    23
0601    24
0602    25
0603    22
0604    21
0605    26
0606    28
0607    27
0608    29
0609    30
dtype: int64

In [42]:
df = temps.reset_index()
df

  index   0
0  0531  23
1  0601  24
2  0602  25
3  0603  22
4  0604  21
5  0605  26
6  0606  28
7  0607  27
8  0608  29
9  0609  30

In [47]:
df.set_index('index').loc[['0605','0602']]

        0
index
0605   26
0602   25

In [50]:
df

  index   0
0  0531  23
1  0601  24
2  0602  25
3  0603  22
4  0604  21
5  0605  26
6  0606  28
7  0607  27
8  0608  29
9  0609  30

In [54]:
df.loc[ [2,4,5] ]

  index   0
2  0602  25
4  0604  21
5  0605  26

In [52]:
df.loc[7]

index    0607
0          27
Name: 7, dtype: object

In [62]:
df.loc[ df[0] > df[0].mean() ]

  index   0
5  0605  26
6  0606  28
7  0607  27
8  0608  29
9  0609  30

In [57]:
df[0].mean()

25.5

In [64]:
df

  index   0
0  0531  23
1  0601  24
2  0602  25
3  0603  22
4  0604  21
5  0605  26
6  0606  28
7  0607  27
8  0608  29
9  0609  30

# smallest = 24 'bites' not 'bits' then you just go up

#this is fun LOLOLOLOL

In [90]:
s = Series([10,20,30,255], dtype = np.uint8)
s.dtype

dtype('uint8')

In [75]:
s

0    10
1    20
2    30
3    40
dtype: int8

In [83]:
2 ** 64

18446744073709551616

In [85]:
s + 3

0     13
1     23
2     33
3   -126
dtype: int8

In [94]:
s = Series(np.random.randint(0,255,10),index=list('abcdefghij')) 
s

a    228
b     10
c    127
d    201
e    181
f    122
g    151
h     27
i    252
j    149
dtype: int64

In [97]:
s.iloc[0] *= 1000
s

a    228000000000
b              10
c             127
d             201
e             181
f             122
g             151
h              27
i             252
j             149
dtype: int64

In [99]:
s.loc['j'] *= 1000
s

a    228000000000
b              10
c             127
d             201
e             181
f             122
g             151
h              27
i             252
j          149000
dtype: int64